package ru.tinkoff.fintech.lesson02.excercises

// ПРАКТИКА 2
// реализуйте класс метры и квадратные метры.
// в классе метров определите операции:
//  - умножения метра на метр
//  - умножения метра на число
//  - сложение
// в классе кв метров определите операции:
// - сложения кв метров
// - умножение кв метров на число

class Meter()

class SqMeter()

// ПРАКТИКА 4
object SqMeter {
  // реализуйте метод сложения "квадратов" от from до to
  def sqRangeSum(from: Int, to: Int): SqMeter = ???
}

object Task02Meters {
}
